export const TourP2step = [
    {
        target: ".formlogin", 
        content:
    "در این پروژه از react js به عنوان کتابخانه اصلی و localstorage , ContextApi , RestApi , axios استفاده شده است و این پروژه ریسپانسیو است و بک اند آن با استفاده از php و دیتابیس mysql ساخته شده است."    
    },
  {
    target: ".maininputdiv", // مورد هدف تور (مثلاً دکمه)
    content:
      "کاربر اینجا اطلاعات ورود را وارد میکند",
  },
  {
    target: ".p2godash", // مورد هدف تور (مثلاً فرم)
    content:
      "پس از اینکه کاربر روی این قسمت کلیک کرد با استفاده از axios و api بررسی میشود که آیا این کاربر در دیتابیس قبلا ثبت نام کرده است یا خیر ، در صورت درست بودن اطلاعات وارد پنل میشود و در غیر اینصورت پیغام اشتباه بودن اطلاعات به او نمایش داده میشود.",
  },
  {
    target: ".p2godash", // مورد هدف تور (مثلاً فرم)
    content:
"اگر کاربر وارد شود اطلاعاتش در localStorage ذخیره میشود و تا زمانی که  از طریق پنل کاربر روی خروج نزند کاربر بدون نیاز به ورود مجدد به صفحه پنل کاربری هدایت میشود  ( البته این زمان قابل تنظیم است ) همچنین اگر کاربر کنجکاو باشد و بدون ورود به حساب آدرس مربوط به پنل کاربری را به صورت مستقیم در نوار url مرورگر وارد کند چون وارد حساب نشده این کاربر به صفحه لاگین هدایت میشود."    
},

 
];
