export const TourP6step = [
  
  {
    target: ".p6slider", 
    content:
  "در این قسمت از پروژه برای ساخت اسلایدر از کتابخانه swiper js  استفاده کرده ام ."  
  },
  {
    target: ".helpveiwstory", 
    content:
"اگر بر روی این هایلایت لمس کنید استوری های مربوطه را مشاهده مینمایید."
  },
  {
    target: ".darkhelp", 
    content:
"این پروژه دارای دارک مود است که به این صورت عمل میکند کاربر وقتی روی آن میزند استیت مربوط به دارک مود true  میشود و با استفاده از یک شرط به این صورت که هر گاه darkmode  برابر true  باشد رنگ های بک گراند و متن ها به رنگ های مشخص شده تغییر کند، همچنین این اتفاق با انیمیشنی نرم رخ میدهد."
  },
  {
    target: ".tabsp6", 
    content:
 "این قسمت پست هایی که از دیتابیس دریافت میشود نمایش داده ام البته در این پروژه یک دیتابیس استاتیک و شبیه سازی شده استفاده کردم اما میشود آنرا از api  با استفاده از axios  یا fetch  دریافت کرد سپس آنرا در یک استیت ذخیره کرد و بر روی آن استیت map کرد و پست ها را نمایش داد ، همچنین در صورتی که کاربر پستی را ذخیره کند در قسمت ذخیره شده ها نمایش داده میشود که برای این کار از context api استفاده کرده ام"
  },

  {
    target: ".tabsp6", 
    content:
"اگر برروی هر پست کلیک شود کاربر میتواند آن پست را لایک کند یا ذخیره کند و همچنین قابلیت کامنت جدید را دارد و میتواند برای کامنتش ایموجی اضافه کند." },
  {
    target: ".tnewpost6", 
    content:
"کاربر اگر روی پست جدید بزند یک modal برایش طراحی کرده ام که از او تصویر و کپشن و هشتگ را دریافت کنم وقتی کاربر آنها را وارد کرد مقادیر را دریافت میشود و سپس این مقادیر به صورت یک آبجکت به آرایه allpost  اضافه میشود و این همان ارایه ای است که به پست های درون دیتابیس یک پست جدید اضافه میکند. "
  },
  {
    target: ".tnewstory6", 
    content:
"کاربر اگر روی استوری جدید بزند یک modal برایش طراحی کرده ام که از او تصویر و در صورت نیاز متن روی استوریدریافت میشود وقتی کاربر آنها را وارد کرد مقادیر را دریافت میشود و سپس این مقادیر به صورت یک آبجکت به آرایه allstories  اضافه میشود و این همان ارایه ای است که اگر کاربر روی تصویر پروفایل بزند میتواند استوری خود را مشاهده کند"
  },
  {
    target: ".tsearch6", 
    content:
"از این قسمت کاربر میتواند طبق هشتگ پست مورد نظر یا کپشن آن جستجو کند مقادیر جستجو از کاربر دریافت شده و  با استفاده از includes  بررسی میشود که آیا این مقادیر در آرایه پست ها وجود دارد یا خیر که اگر وجود داشت پست های مورد نظر به او نمایش داده میشود و اگر وجود نداشته باشد پیغام مناسب به او نمایش داده میشود."
  },
];
