export const TourP4step = [
    {
        target: ".bginsert", 
        content:
  "در این پروژه که با استفاده از ری اکت جی اس ساخته شده است از useMemo ، انیمیشن های سی اس اس ،  resposive design  استفاده شده است و تمرکز این پروژه ای که ساختم نمایش استفاده ازهوک useMemo  است این هوک باعث دخیره سازی و کش کردن اطلاعاتی میشود که با آپدیت دیگر استیت ها مقادیری که در این هوک هستند آپدیت نمیشود و تنها در صورتی این مقادیر رندر میشود که dependency  های این هوک مقادیرش تغییر کند و در نهایت استفاده بهینه از این امر باعث افزایش کارایی و سرعت وبسایت میشود"
    },
  {
    target: ".bginsert", // مورد هدف تور (مثلاً دکمه)
    content:
    "و اما نحوه کار این پروژه ، این پروژه که در آن یک تودو لیست ساخته ام به این صورت عمل میکند که کاربر ابتدا یادداشت خود را وارد میکند و با استفاده از تابع ای که ایجاد کرده ام متن درون اینپوت دریافت میشود و در نهایت در استیت listnote  به عنوان یک آرایه جدید در ابجکت ذخیره سازی میشود و در نهایت این این ابجکت map میشود و به کاربر به شکل یک لیست نمایش داده میشود."
},
  {
    target: ".bginsert", // مورد هدف تور (مثلاً فرم)
    content:
"پس از آنکه کاربر یادداشتی اضافه کرد این امکان را دارد که با استفاده از تابع deleteitem یادداشتش را پاک کند و همچنین یک امکان فراهم شده که کاربر بتواند آن یادداشت را در لیست کامل شده ها یا کامل نشده ها قرار دهد نحوه کار به این صورت است که وقتی کاربر تیک چک باکس یادداشت را میزند آن یادداشت با ایدی اش دریافت میشود و سپس استیت listnote  آپدیت شده و مقدار checked  آن آیتم خاص به true  تغییر میکند همچنین اگر چک باکس را بردارد این مقدار به false  تغییر میکند و به نوعی کامل نشده میشود."
},
  {
    target: ".bginsert", // مورد هدف تور (مثلاً فرم)
    content:
  "کاربر میتواند کامل نشده ها و کامل شده ها را بصورت جدا مشاهده کند عملکرد به این صورت است که وقتی روی کامل شده بزند تمام آیتم هایی که checked  آنها برابر true  است به او نمایش داده میشود و اگر روی کامل نشده بزند آنهایی را به او نمایش میدهد که checked  آنها برابر false است و اگر روی all یا همه بزند تمامی ایتم ها را چه true  باشد و چه  false  به او نمایش داده میشود"
},

 
];
