import React from 'react'
import './HomeSec2.css'
export default function HomeSec2() {
  return (
    <div className="HomeSec2">
    <p  className="sec2shoptitle">نحوه کار</p>
    <div className="sec2cards">
      <div id='help' className="sec2singlecart">
       
        <div className="svgsec2shop">
        <svg width="50" height="50" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
<path opacity="0.4" d="M26.6568 25.271H19.0644C18.3237 25.271 17.7212 25.883 17.7212 26.6355C17.7212 27.3894 18.3237 28 19.0644 28H26.6568C27.3975 28 28 27.3894 28 26.6355C28 25.883 27.3975 25.271 26.6568 25.271Z" fill="#FEFEFE"/>
<path d="M13.7454 9.20514L20.9398 15.0186C21.1134 15.1576 21.143 15.4127 21.0076 15.5905L12.4783 26.7043C11.9422 27.3908 11.152 27.7792 10.3054 27.7936L5.64928 27.8509C5.40095 27.8538 5.18366 27.6818 5.12723 27.4352L4.06901 22.8344C3.88558 21.9887 4.06901 21.1144 4.60517 20.4408L13.1767 9.27393C13.315 9.09477 13.5704 9.06324 13.7454 9.20514Z" fill="#FEFEFE"/>
<path opacity="0.4" d="M24.1607 11.5539L22.7737 13.2853C22.6341 13.4616 22.3829 13.4903 22.2094 13.3498C20.5233 11.9853 16.2057 8.4838 15.0078 7.51345C14.8329 7.37012 14.8089 7.115 14.95 6.93727L16.2876 5.27608C17.501 3.71378 19.6174 3.57045 21.3247 4.93208L23.2859 6.49438C24.0902 7.12503 24.6263 7.95634 24.8098 8.83065C25.0214 9.7924 24.7956 10.7369 24.1607 11.5539Z" fill="#FEFEFE"/>
</svg>

        </div>
        <div className="infocartsec2">
        <div className="titlecardsec2">۱. انتخاب متن موزیک</div>
        <div className="textcartsec2" style={{fontSize:"14px",fontWeight:400}}>در مرحله اول، می‌تونید از یکی از منابع متن آهنگی که نیکی‌شاپ باهاشون کار می‌کنه موزیک مورد علاقتون رو پیدا کنید . سپس بخشی از متن آهنگ رو که دوست دارین طرحتون بر اساس اون ایجاد بشه رو هایلایت می‌کنید.</div>
        </div>
      </div>


      <div className="sec2singlecart">
        <div  className="svgsec2shop">
        <svg width="50" height="50" viewBox="0 0 28 22" fill="none" xmlns="http://www.w3.org/2000/svg">
<path fill-rule="evenodd" clip-rule="evenodd" d="M8.79683 10.9999C8.79683 13.8444 11.1253 16.1587 14.0001 16.1587C16.8619 16.1587 19.1903 13.8444 19.1903 10.9999C19.1903 8.14254 16.8619 5.8282 14.0001 5.8282C11.1253 5.8282 8.79683 8.14254 8.79683 10.9999ZM21.6489 3.06133C23.9253 4.81972 25.8635 7.39264 27.2554 10.612C27.3594 10.8577 27.3594 11.1421 27.2554 11.3749C24.4716 17.8137 19.5155 21.6666 14.0001 21.6666H13.9871C8.48463 21.6666 3.52854 17.8137 0.744797 11.3749C0.640732 11.1421 0.640732 10.8577 0.744797 10.612C3.52854 4.17325 8.48463 0.333252 13.9871 0.333252H14.0001C16.7578 0.333252 19.3724 1.29002 21.6489 3.06133ZM14.0016 14.2165C15.7838 14.2165 17.2407 12.7684 17.2407 10.9971C17.2407 9.21283 15.7838 7.76475 14.0016 7.76475C13.8455 7.76475 13.6894 7.77768 13.5464 7.80354C13.4943 9.22576 12.3236 10.3635 10.8797 10.3635H10.8146C10.7756 10.5704 10.7496 10.7773 10.7496 10.9971C10.7496 12.7684 12.2065 14.2165 14.0016 14.2165Z" fill="#FEFEFE"/>
</svg>


        </div>
        <div className="infocartsec2">
        <div className="titlecardsec2">۲. پیش‌نمایش طرح</div>
        <div className="textcartsec2" style={{fontSize:"14px",fontWeight:400}}>
        در این مرحله بر اساس موزیک انتخابی شما و متن مورد علاقه‌ی هایلایت شده، طرح اختصاصی شما آماده می‌شه و پیش‌نمایشش رو روی یک تی‌شرت سفید می‌بینید. این طرح شامل یه کاوری می‌شه که منحصر به شماست و اسم موسیقی، خواننده اون و متن هایلایت شده شما رو هم در بر داره.
          </div>
          </div>
      </div>


      <div className="sec2singlecart">
        <div className="svgsec2shop">
        <svg width="50" height="50" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
<path fill-rule="evenodd" clip-rule="evenodd" d="M27.8843 21.7531L26.8592 13.4936C26.2346 10.5464 24.467 9.3335 22.7819 9.3335H9.24228C7.53362 9.3335 5.70713 10.4615 5.17685 13.4936L4.13987 21.7531C3.29144 27.8174 6.41416 29.3335 10.4914 29.3335H21.5446C25.6101 29.3335 28.6385 27.1382 27.8843 21.7531ZM12.1293 16.1983C11.4785 16.1983 10.9509 15.6552 10.9509 14.9854C10.9509 14.3156 11.4785 13.7726 12.1293 13.7726C12.7801 13.7726 13.3077 14.3156 13.3077 14.9854C13.3077 15.6552 12.7801 16.1983 12.1293 16.1983ZM18.6694 14.9854C18.6694 15.6552 19.197 16.1983 19.8478 16.1983C20.4986 16.1983 21.0261 15.6552 21.0261 14.9854C21.0261 14.3156 20.4986 13.7726 19.8478 13.7726C19.197 13.7726 18.6694 14.3156 18.6694 14.9854Z" fill="#FEFEFE"/>
<path opacity="0.4" d="M22.6317 9.03251C22.6359 9.13593 22.6161 9.23892 22.5737 9.33341H20.6575C20.6204 9.23734 20.6008 9.13545 20.5995 9.03251C20.5995 6.47585 18.5197 4.40326 15.9543 4.40326C13.3888 4.40326 11.309 6.47585 11.309 9.03251C11.3266 9.13205 11.3266 9.23388 11.309 9.33341H9.34644C9.32886 9.23388 9.32886 9.13205 9.34644 9.03251C9.49555 5.47463 12.4332 2.66675 16.0065 2.66675C19.5798 2.66675 22.5175 5.47463 22.6666 9.03251H22.6317Z" fill="#FEFEFE"/>
</svg>


        </div>
        <div className="infocartsec2">
        <div className="titlecardsec2">
        ۳. نهایی کردن سفارش
          </div>
        <div className="textcartsec2" style={{fontSize:"14px",fontWeight:400}}>
        اگه پیش‌نمایشی که دیدین دل شما رو برد و می‌خواین این تی‌شرت اختصاصی رو داشته باشین، یا به محبوبتون هدیه بدین، می‌تونین خیلی ساده سفارشتون رو نهایی کنید.
            </div>
            </div>
      </div>
    </div>
  </div>
  )
}
