export const listmusic=[
    {id:1,artist:"دایان",name:"کنار تو - دایان" ,cover:"https://mustext.net/wp-content/uploads/2024/03/Dayan-Kenare-To.webp",text:`تصویر تو از توو چشام خیلی وقته رفته
    با اینکه سرد شدم هنوز، ندیدنت سخته
    کسی نیومده به جات بعدِ این همه وقت که
    بدونِ تو الآن روزام پُر نقطه ضعفه
    
    من کنارِ تو خوشحالم، با تو دنیا رو دوست دارم
    (تویی نگار من)
    بی تو روزام تیره و تارن، همه آسونا دشوارن
    (تویی تکیه گاهِ من)
    من کنارِ تو خوشحالم، با تو دنیا رو دوست دارم
    (تویی نگار من)
    بی تو روزام تیره و تارن، همه آسونا دشوارن
    (تویی تکیه گاهِ من)
    
    چه جاهایی نمیرفتیم کنارِ هم
    چه کارایی، نمیکردیم چقد غرق خوشی بودیم
    نفهمیدیم که میگذشتن چه روزایی
    چه شب هایی نمیگفتیم کنارِ هم
    چه حرفایی، نمیدونم کجای زندگیم رفتی
    که بی تو میکشنه بغضم یه وقتایی
    
    من کنارِ تو خوشحالم، با تو دنیا رو دوست دارم
    (تویی نگار من)
    بی تو روزام تیره و تارن، همه آسونا دشوارن
    (تویی تکیه گاهِ من)
    من کنارِ تو خوشحالم، با تو دنیا رو دوست دارم
    (تویی نگار من)
    بی تو روزام تیره و تارن، همه آسونا دشوارن
    (تویی تکیه گاهِ من)
    
    نفس در سینه ساکت شو
    همینک یار می آید
    طبيب بي مروت بر سر بيمار مي آيد` ,nameontshert:"Dayen-kenare to"}

    ,

    {id:2,artist:"اشوان",name:"بخند - اشوان" ,cover:"https://mustext.net/wp-content/uploads/2019/03/Ashvan-Bekhand.jpg",text:`
    اگه دلت گرفته ، اگه که نا امیدی

اگه توو اوجِ سختی ، بازم ادامه میدی

اگه دلشوره داری ، نمیخوابی انقدر که بی قراری

نباید نا امید باشی چون تو ، خدا رو داری

تو برو زیرِ بارون ، نگاه به این و اون نکن

و دستتو بگیر رو به روی آسمون

بخند چشاتو ببند

برو پیشِ مادرت فکر کن این باره آخره

بگو که دوسش داری همیشه تا آخرش

خندید تو هم بخند

کمک کن به کسی که محتاجِ به نونِ شب

حاضره بده واسه بچش حتی جونش هم

زیرِ نور شمع ، توو آغوشِ هم

اگه خندیدن ، تو هم بخند

تو برو زیرِ بارون ، نگاه به این و اون نکن

و دستتو بگیر رو به روی آسمون

بخند چشاتو ببند

برو پیشِ مادرت فکر کن این باره آخره

بگو که دوسش داری همیشه تا آخرش

خندید تو هم بخند

اگه یه دیوونه ، یه فقیر بی خونه

تو اوجِ درد و رنجش میخنده میخونه

اگه تو اوجِ دردی ، خدا رو حس کردی

پس بخند ، آره بخند

تو برو زیرِ بارون ، نگاه به این و اون نکن

و دستتو بگیر رو به روی آسمون

بخند چشاتو ببند

برو پیشِ مادرت فکر کن این باره آخره

بگو که دوسش داری همیشه تا آخرش

خندید تو هم بخند

تو برو زیرِ بارون ، نگاه به این و اون نکن

و دستتو بگیر رو به روی آسمون

بخند چشاتو ببند

برو پیشِ مادرت فکر کن این باره آخره

بگو که دوسش داری همیشه تا آخرش

خندید تو هم بخند ، تو هم بخند` ,nameontshert:"Ashvan-bekhand"}

    ,

    {id:3,artist:"ایهام",name:"عشق - ایهام" ,cover:"https://mustext.net/wp-content/uploads/2020/01/ehaam-eshgh.jpg",text:`مستم از این شبِ طولانی ،مستم از این دلِ دیوانه

    حال و هوایِ تو را دارم ، عطرِ تو مانده بر این شانه
    
    عشق چیز عجیب نیست ، عاشقِ تو میمانم
    
    عشقِ منی هر لحظه ، قدرِ تو را میدانم
    
    از آن همه تنهایی ، با تو نمیترسیدم
    
    عشق یعنی بی وقفه ، به تو می اندیشم
    
    ای دلِ دیوانه ، حرف دلت را میدانم
    
    ای دلِ دیوانه ، من به هوایِ تو میخوانم
    
    ای دلِ دیوانه ، حرفِ دلت را میدانم
    
    ای دلِ دیوانه ، من به هوایِ تو میخوانم
    
    هستم اگر به تو دلبستم ، تشنه منم تو بارانی
    
    جان و جوانیِ من اینجاست ، با تو در این شبِ طولانی
    
    برقِ نگاهت آتش ، زد بر دلِ این خانه
    
    جز تو نمیخواهم من ، عشقِ منی دیوانه
    
    بی تو چه میدانستم ، بی تو چه میفهمیدیم
    
    عشق یعنی هر لحظه ، به تو می اندیشیدم
    
    ای دلِ دیوانه ، حرف دلت را میدانم
    
    این دلِ دیوانه ، من به هوایِ تو میخوانم
    
    ای دلِ دیوانه ، حرفِ دلت را میدانم
    
    ای دلِ دیوانه ، من به هوایِ تو میخوانم
    
    دل دیوانه ، دل دیوانه ، دل دیوانه …
    
    ای دلِ دیوانه ، حرف دلت را میدانم
    
    ای دلِ دیوانه ، من به هوایِ تو میخوانم
    
    ای دلِ دیوانه ، حرفِ دلت را میدانم
    
    ای دلِ دیوانه ، من به هوایِ تو میخوانم` ,nameontshert:"Eham-eshgh"}
]