export const TourP3step = [
    {
        target: ".swiper", 
        content:
   "در این پروژه از کتابخانه react js و همچنین از material ui , material ui icon , swiper js, css Animation , resposive design , localstorage استفاده شده است."
    },
  {
    target: ".starp3", // مورد هدف تور (مثلاً دکمه)
    content:
   "این قسمت پروژه کاملا داینامیک است و طبق اطلاعات دیتابیس تغییر میکند برای مثال درون دیتابیس rate:3 باشد بصورت داینامیک 3 ستاره طلایی و 2 ستاره سفید قرار میگیرد."
  },
  {
    target: ".swiper-slide", // مورد هدف تور (مثلاً فرم)
    content:
"در هر یک از اسلاید ها از تکنیک های مختلف سی اس اس استفاده شده به طور مثال از FLEX استفاده شده است و همچنین با استفاده از پوزیشن های مختلف و قابلیت هاور این اسلاید ها طراحی شده اند."    
},
  {
    target: ".addtocartp3", // مورد هدف تور (مثلاً فرم)
    content:
   " زمانی که کاربر روی افزودن به سبد خرید بزند تابع ADDTOCART انجام میشود و ابتدا با استفاده از ایدی محصول این محصول را در دیتابیس پیدا کردم و سپس آنرا درون استیت مربوط به ایتم های سبد خرید ذخیره کرده ام همچنین استیت محتوای سبد خرید را در localstorage  ذخیره کرده ام تا با رفرش صفحه اطلاعات سبد خرید پاک نشود."

},
{
    target: ".cartshowlogop3", // مورد هدف تور (مثلاً فرم)
    content:
    "و اما قسمت مربوط به سبد خرید ، این قسمت با استفاده از انیمیشن های سی اس اس طراحی شده است، همچنین تعداد محصولات موجود در سبد خرید نیز نمایش داده میشود"
 },

 {
    target: ".cartshowlogop3", // مورد هدف تور (مثلاً فرم)
    content:
    " آیتم های درون سبد خرید از لوکال استوریج دریافت میشود و به کاربر نمایش داده میشود همچنین هر کدام از این آیتم ها قابلیت حذف شدن دارند و وقتی کاربر روی دکمه حذف میزند تابع deleteitem  انجام میشود این تابع به اینصورت عمل میکند که ایدی مربوط به محصول رو دریافت میکنم و با استفاده از filter   سبد خرید را طبق آن فیلتر میکند همچنین اگر چند بار یک محصول اضافه شده باشد با توجه به ایندکس آن محصول خاص فیلتر انجام میشود."
},
 

{
    target: ".cartshowlogop3", // مورد هدف تور (مثلاً فرم)
    content:
    "یکی از قابلیت های این سبد خرید جمع کل مبلغ ها است که این کار با استفاده از reduce  انجام شده است." 
},

{
    target: ".swiper", // مورد هدف تور (مثلاً فرم)
    content:
    "در آخر این نکته را بگویم که من میتوانم با استفاده از props  و در پروژه های پیشرفته تر با استفاده از contextApi  محصولات انتخاب شده را در هر جایی نمایش دهم و در صورت خرید میتوانم آنرا درون داشبورد کاربر نمایش دهم ، همچنین با استفاده از امکانات بک اندی مانند id  و userid  محصولات خریداری شده را بصورت تفکیک شده برای هر کاربر بدون قاطی شدن آنها در حساب کاربری آنها نمایش دهم "
},
];
